Repository: med-timely/bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: An error occurred while processing your message. Please try again later.
ru: Произошла ошибка при обработке вашего сообщения. Пожалуйста, попробуйте позже.

source: 🆘 Help: /me - Show your profile information /schedule - Create medication schedule /list - Show active medications /taken - Confirm dose taken /history - Show medication adherence history /stop - Stop medication schedule
ru: 🆘 Помощь: /me - Показать информацию профиля /schedule - Создать расписание приема лекарств /list - Показать активные расписания /taken - Подтвердить прием дозы /history - Показать историю приема лекарств /stop - Завершить прием

source: Start the bot
ru: Запустить бота

source: Show help
ru: Помощь

source: ✅ Accept
ru: ✅ Принять

source: ❌ Decline
ru: ❌ Отклонить

source: 📱 Share Phone
ru: 📱 Поделиться контактом

source: ➡️ Skip
ru: ➡️ Пропустить

source: 🌍 Share Location
ru: 🌍 Поделиться местоположением

source: Welcome back! Use /schedule to manage medications.
ru: С возвращением! Используйте /schedule для создания расписания.

source: 👋 Welcome to MedTimely! Before we start, please: 1. Read our [Privacy Policy](https://tnfy.link/5nBW) 2. Confirm you agree with data processing
ru: 👋 Добро пожаловать в ПилюляБот! Перед тем как начать, пожалуйста: 1. Прочитайте нашу [Политику конфиденциальности](https://tnfy.link/5nBW) 2. Подтвердите, что вы согласны с обработкой данных

source: ❌ You must accept the privacy policy to use this service.
ru: ❌ Необходимо принять политику конфиденциальности, чтобы использовать бота.

source: Thank you for accepting our privacy policy! 🎉 Would you like to share your phone number for emergency contacts?
ru: Спасибо, что приняли нашу политику конфиденциальности! 🎉 Хотите поделиться своим номером телефона для возможности восстановления доступа?

source: Please use the buttons to accept or decline the privacy policy.
ru: Пожалуйста, используйте кнопки, чтобы принять или отклонить политику конфиденциальности.

source: ⚠️ Please share your phone number.
ru: ⚠️ Пожалуйста, поделитесь своим номером телефона.

source: ⚠️ Please share your own phone number.
ru: ⚠️ Пожалуйста, поделитесь своим собственным номером телефона. Он должен совпадать с номером телефона в профиле Telegram.

source: ✅ Phone number saved!
ru: ✅ Номер телефона сохранен!

source: You can add phone later in profile.
ru: Вы можете добавить телефон позже в профиль.

source: Please use the buttons below to share phone or skip.
ru: Пожалуйста, используйте кнопки ниже, чтобы поделиться контактом или пропустить.

source: 🌍 For accurate medication reminders, we need your timezone. Please either: 1. Share your current location 2. Send your local time (e.g. 14:30)
ru: 🌍 Для точных напоминаний о приеме лекарств нам нужен Ваш часовой пояс. Пожалуйста, либо: 1. Поделитесь своим текущим местоположением 2. Отправьте свое местное время (например, 14:30)

source: Please use the buttons to share phone number or skip.
ru: Пожалуйста, используйте кнопки, чтобы поделиться контактом или пропустить.

source: ✅ Timezone detected: {tz}
ru: ✅ Определен часовой пояс: {tz}

source: ✅ Timezone set to {tz} (UTC{offset:+g})
ru: ✅ Часовой пояс установлен на {tz} (UTC{offset:+g})

source: 📍 Multiple matches found. Please choose the most suitable timezone:
ru: 📍 Найдено несколько совпадений. Пожалуйста, выберите наиболее подходящий часовой пояс:

source: 💊 Now let's create your first medication schedule! Use /schedule command and follow the instructions. Type /help anytime for assistance.
ru: 💊 Теперь давайте создадим Ваше первое расписание приема лекарств! Используйте команду /schedule и следуйте инструкциям. В любое время введите /help для получения помощи.

source: ❌ Couldn't detect timezone. Please try again.
ru: ❌ Не удалось определить часовой пояс. Пожалуйста, попробуйте еще раз.

source: Show your profile information
ru: Показать информацию о профиле

source: Enter your new daylight hours (start and end) in 24-hour format: Example: 8 22
ru: Введите свои новые часы бодрствования (начало и окончание) в 24-часовом формате: Например: 8 22

source: ❌ Edit cancelled
ru: ❌ Редактирование отменено

source: ❌ Invalid input. Please enter your new daylight hours:
ru: Некорректный ввод. Пожалуйста, попробуйте еще раз:

source: Please send two hour numbers, e.g. 8 22 or 08-22
ru: Пожалуйста, отправьте два числа, например, 8 22 или 08-22

source: Hours must be between 0-23
ru: Часы должны быть от 0 до 23

source: Start hour must be before end hour
ru: Начальный час должен быть раньше окончательного часа

source: ❌ Internal error while saving, please try again later.
ru: ❌ Внутренняя ошибка при сохранении, пожалуйста, попробуйте еще раз.

source: ✅ Daylight hours updated to {start}:00 – {end}:00
ru: ✅ Часы бодрствования изменены на {start}:00 - {end}:00

source: ❌ Error: {err}. Please try again:
ru: ❌ Ошибка: {err}. Пожалуйста, попробуйте еще раз:

source: ✏️ Edit Hours
ru: ✏️ Редактировать часы

source: 👤 Your Profile: Name: {name} Username: {username} Role: {role} Language: {language} Timezone: {timezone} Daylight Hours: {day_start} - {day_end} Privacy: {privacy}
ru: 👤 Ваш профиль: Имя: {name} Имя пользователя: {username} Роль: {role} Язык: {language} Часовой пояс: {timezone} Часы бодрствования: {day_start} - {day_end} Политика конфиденциальности: {privacy}

source: Not set
ru: Не указано

source: Accepted
ru: ✅ Принята

source: Not Accepted
ru: ❌ Не принята

source: Create new medication schedule
ru: Создать новое расписание приема лекарств

source: Show active medications
ru: Показать активные расписания

source: Confirm dose taken
ru: Подтвердить прием дозы

source: Show medication adherence history
ru: Показать историю приема лекарств

source: Stop medication schedule
ru: Остановить расписание приема лекарств

source: ❌ Cancel
ru: ❌ Отменить

source: skip
ru: пропустить

source: ➡️ skip
ru: ➡️ пропустить

source: Schedule creation canceled.
ru: Создание расписания отменено.

source: {duration} day
ru: {duration} день

source: not specified
ru: не указано

source: {frequency} time/day
ru: {frequency} раз/день

source: 📝 Please confirm your medication schedule:
ru: 📝 Пожалуйста, подтвердите Ваше расписание приема лекарств:

source: 💊 Drug: {drug_name}
ru: 💊 Лекарство: {drug_name}

source: 📏 Dose: {dose}
ru: 📏 Доза: {dose}

source: ⏰ Frequency: {frequency}
ru: ⏰ Частота: {frequency}

source: 📅 Duration: {duration}
ru: 📅 Длительность: {duration}

source: 📝 Note: {comment}
ru: 📝 Примечание: {comment}

source: None
ru: Отсутствует

source: ✅ Confirm
ru: ✅ Подтвердить

source: 👋 Welcome to MedTimely! Before we start, please register: /start
ru: 👋 Добро пожаловать в ПилюляБот! Перед началом, пожалуйста, зарегистрируйтесь: /start

source: I couldn't parse that as a prescription. Let's continue step by step.
ru: Я не смог распознать это как рецепт. Продолжим по шагам.

source: 💊 Let's create a new medication schedule. You can either: 1. Enter details step by step, starting with the drug name 2. Paste a prescription line (e.g. 'Take Aspirin 1 tablet 3 times daily for 7 days')
ru: 💊 Давайте создадим новое расписание приема лекарств. Вы можете: 1. Ввести данные по шагам, начиная с названия лекарства 2. Вставить строку рецепта (например, 'Принимать Аспирин 1 таблетка 3 раза в день в течение 7 дней')

source: Please enter a valid drug name:
ru: Пожалуйста, введите правильное название лекарства:

source: 📏 Enter dosage (e.g. '1 tablet', '500mg'):
ru: 📏 Укажите дозу (например, '1 таблетка', '500мг'):

source: ⏰ How many times per day? (Enter number):
ru: ⏰ Сколько раз в день? (Введите число):

source: Please enter a valid frequency:
ru: Пожалуйста, введите правильную частоту:

source: 📅 Duration in days? (Enter number):
ru: 📅 Сколько раз в день? (Введите число):

source: Please enter a valid positive number:
ru: Пожалуйста, введите положительное число:

source: Please enter a valid duration:
ru: Пожалуйста, введите корректную длительность:

source: 📝 Any comments? (Optional, type 'skip' to omit):
ru: 📝 Дополнительные примечания? (Необязательно, введите 'пропустить' чтобы пропустить):

source: Please enter a valid comment:
ru: Пожалуйста, введите примечание:

source: ✅ Schedule created successfully! Next dose: {next_dose} You'll receive reminders when it's time to take your medication.
ru: ✅ Расписание создано успешно! Следующий прием: {next_dose} Вы будете получать напоминания, когда придет время принять лекарство.

source: No doses scheduled (schedule may be complete)
ru: Нет запланированных приемов

source: Error creating schedule: {error}
ru: Ошибка при создании расписания: {error}

source: ongoing
ru: в процессе

source: 📅 Since {date}
ru: 📅 С {date}

source: 📅 Duration: {days} day
ru: 📅 Длительность: {days} день

source: ⏳ Next dose: {time}
ru: ⏳ Следующая доза: {time}

source: ✅ Course completed
ru: ✅ Курс завершен

source: 📝 Note: {comment}
ru: 📝 Примечание: {comment}

source: 📅 Medication Adherence Report:
ru: 📅 Отчет о приеме лекарств:

source: 💊 {drug} ({dose}): ✅ Taken: {taken}/{total} ({percentage}%) ⏰ On Time: {on_time} 🕒 Late: {late} ❌ Missed: {missed}
ru: 💊 {drug} ({dose}): ✅ Принято: {taken}/{total} ({percentage}%) ⏰ Вовремя: {on_time} 🕒 С опозданием: {late} ❌ Пропущено: {missed}

source: Invalid input. Please provide a valid number of days.
ru: Некорректный ввод. Пожалуйста, укажите корректное значение.

source: Please specify a positive number of days
ru: Пожалуйста, введите положительное число:

source: Maximum history period is 1 year (365 days)
ru: Максимальный период истории - 1 год (365 дней)

source: No medication history found for the last {days} day
ru: История приема лекарств за последний {days} день не найдена

source: ℹ️ You have no active medication schedules.
ru: ℹ️ У вас нет активных расписаний приема лекарств.

source: 💊 <b>Active Medications:</b>
ru: 💊 <b>Активные лекарства:</b>

source: Choose a schedule to stop:
ru: Выберите расписание для остановки:

source: ⏹️ Schedule stopped:
ru: ⏹️ Расписание остановлено:

source: Failed to stop schedule {schedule_id}.
ru: Не удалось остановить расписание {schedule_id}.

source: 🎉 No active medications to log now!
ru: 🎉 Нет активных лекарств для отметки сейчас!

source: 💊 Which medication did you take?
ru: 💊 Какое лекарство вы приняли?

source: Schedule not found or doesn't belong to you
ru: Расписание не найдено или не принадлежит вам

source: Schedule has ended
ru: Прием завершен

source: Dose already recorded
ru: Доза уже отмечена

source: ✅ Dose logged successfully for {drug_name}!
ru: ✅ Доза отмечена успешно для {drug_name}!

source: ⏰ Reminder: Time to take your medications:
ru: ⏰ Напоминание: Время принять лекарства:
